---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.NeedTwoPartsToMerge
source: html/b826a663-9f4b-34a4-c4a4-4c76338f2f1a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.NeedTwoPartsToMerge Property

Attempt to merge fewer than two parts. There must be at least two. No part will be produced.

## Syntax (C#)
```csharp
public static FailureDefinitionId NeedTwoPartsToMerge { get; }
```